#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void pascal(n)
{
	int i, j;
	int p[10][10] = { 0 };
	/*
	3 * 2 - 1
	00100
	01010
	10201
	
	4 * 2 - 1
	0001000
	0010100
	0102010
	1030301

	000000000
	000010000 (p[1][n] = 1)
	000101000 (i=2)(j는 1부터 7까까지)
	001020100 (i=3)(j는 1부터 7까까지)
	010303010 (i=4)(j=1~7)
	p[2][1] = p[1][0] + p[1][1]
	출력은 열 1~4, 행 1~7
	*/
	//p[0][0] = 1;
	//p[1][0] = 1; p[1][1] = 1;

	p[1][n] = 1;
	for (i = 2; i <= n; i++)
	{
		for (j = 1; j < n*2; j++)
		{
			p[i][j] = p[i - 1][j - 1] + p[i - 1][j+1];
		}
	}
	
	//p[0][0] = 0;
	//p[1][0] = 0; p[1][1] = 1;
	//p[2][0] = 0; p[2][1] = p[1][0] + p[1][1] = 1; p[2][2] = p[1][1] + p[1][2] = 1;
	//p[3][0] = 0; p[3][1] = p[2][0] + p[2][1] = 1; p[3][2] = p[2][1] + p[2][2] = 2; p[3][3] = p[2][2] + p[2][3] = 1;
	// 첫째 행,렬의 0을 생략하고 출력하는 의도

	/*
	for (i = 0; i < n; i++)
	{
		for (j = 0; j <= i; j++)
		{
			if ((j == 0) || (j == i))
			{
				p[i][j] = 1;
			}
			else
			{
				p[i][j] = p[i - 1][j - 1] + p[i - 1][j];
				//p[i + 1][j + 1] = p[i][j] + p[i][j + 1];
			}
		}
		j = 0;
	}
	*/
	//p[0][0] = 1;
	//p[1][0] = 1; p[1][1] = 1;
	//p[2][0] = 1; p[2][1] = p[1][0] + p[1][1]; p[2][2] = 0;
	//p[3][0] = 1; p[3][1] = p[2][0] + p[2][1]; p[3][2] = p[2][1] + p[2][2];
	//p[1][0] = p[0][-1] + p[0][0];
	//p[2][0] = p[1][-1] + p[1][0];
	//p[2][1] = p[1][0] + p[1][1];
		
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j < n*2; j++)
		{
			if (p[i][j] != 0)
				printf("%d	", p[i][j]);
			else
				printf("	");
		}
		printf("\n");
	}
}
int main()
{
	freopen("input.txt", "r", stdin);

	setbuf(stdout, NULL);
	int T, test_case;
	scanf("%d", &T);

	for (test_case = 1; test_case <= T; test_case++)
	{
		int n;
		printf("#%d\n", test_case);
		/////////////////////
		scanf("%d", &n);

		pascal(n);
		//////////////////
	}
	return 0;
}
